# ┌───────────────────────────────────────────────────────────────────────────┐
# │                              Homebrew Brewfile                             │
# │                    Install with: brew bundle --file=Brewfile               │
# └───────────────────────────────────────────────────────────────────────────┘

# ─────────────────────────────────────────────────────────────────────────────
# Taps
# ─────────────────────────────────────────────────────────────────────────────
tap "homebrew/bundle"
tap "hashicorp/tap"

# ─────────────────────────────────────────────────────────────────────────────
# Core Tools
# ─────────────────────────────────────────────────────────────────────────────
brew "stow"           # Symlink manager for dotfiles
brew "git"            # Version control
brew "neovim"         # Modern Vim
brew "tmux"           # Terminal multiplexer
brew "starship"       # Cross-shell prompt

# ─────────────────────────────────────────────────────────────────────────────
# Modern CLI Replacements
# ─────────────────────────────────────────────────────────────────────────────
brew "eza"            # Modern ls replacement
brew "bat"            # Modern cat with syntax highlighting
brew "ripgrep"        # Fast grep alternative
brew "fd"             # Modern find alternative
brew "zoxide"         # Smarter cd command
brew "fzf"            # Fuzzy finder
brew "delta"          # Better git diff

# ─────────────────────────────────────────────────────────────────────────────
# Shell & Utilities
# ─────────────────────────────────────────────────────────────────────────────
brew "zsh-autosuggestions"       # Fish-like autosuggestions
brew "zsh-syntax-highlighting"   # Fish-like syntax highlighting
brew "fastfetch"                 # System info display
brew "htop"                      # Process viewer
brew "jq"                        # JSON processor
brew "yq"                        # YAML processor
brew "tree"                      # Directory tree view

# ─────────────────────────────────────────────────────────────────────────────
# Development
# ─────────────────────────────────────────────────────────────────────────────
brew "python"
brew "node"
brew "go"

# ─────────────────────────────────────────────────────────────────────────────
# Infrastructure & DevOps
# ─────────────────────────────────────────────────────────────────────────────
brew "kubectl"                   # Kubernetes CLI
brew "helm"                      # Kubernetes package manager
brew "hashicorp/tap/terraform"   # Infrastructure as code
brew "terragrunt"                # Terraform wrapper
brew "awscli"                    # AWS CLI
brew "azure-cli"                 # Azure CLI

# ─────────────────────────────────────────────────────────────────────────────
# Fonts (requires: tap "homebrew/cask-fonts")
# ─────────────────────────────────────────────────────────────────────────────
cask "font-jetbrains-mono-nerd-font"

# ─────────────────────────────────────────────────────────────────────────────
# Applications
# ─────────────────────────────────────────────────────────────────────────────
cask "ghostty"        # GPU-accelerated terminal
